package com.example.user.weather;

import android.content.Intent;
import android.content.pm.ActivityInfo;
import android.net.Uri;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.util.Log;
import android.view.View;
import android.widget.AdapterView;
import android.widget.ArrayAdapter;
import android.widget.MediaController;
import android.widget.Spinner;
import android.widget.VideoView;

import org.jsoup.Jsoup;
import org.jsoup.nodes.Document;

public class MainActivity extends AppCompatActivity {

    public int[] num = new int[2];
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);

        spiCity();

    }


    //=========================Button && Crawler==========================//
    public void buttonClick(View view) throws Exception{
        final String[][] aUrl = {{"1001701","1001702","1001703","1001704","1001705","1001706","1001707"},
                {"6300100","6300200","6300300","6300400","6300500","6300600","6300700","6300800","6300900","6301000","6301100","6301200"},
                {"6500100","6500200","6500300","6500400","6500500","6500600","6500700","6500800","6500900","6501000","6501100","6501200","6501300","6501400","6501500","6501600","6501700","6501800","6501900","6502000","6502100","6502200","6502300","6502400","6502500","6502600","6502700","6502800","6502900"},
                {"6800100","6800200","6800300","6800400","6800500","6800600","6800700","6800800","6800900","6801000","6801100","6801200","6801300"},
                {"1001801","1001802","1001803"},
                {"1000401","1000402","1000403","1000404","1000405","1000406","1000407","1000408","1000409","1000410","1000411","1000412","1000413"},
                {"1000501","1000502","1000503","1000504","1000505","1000506","1000507","1000508","1000509","1000510","1000511","1000512","1000513","1000514","1000515","1000516","1000517","1000518"},
                {"6600100","6600200","6600300","6600400","6600500","6600600","6600700","6600800","6600900","6601000","6601100","6601200","6601300","6601400","6601500","6601600","6601700","6601800","6601900","6602000","6602100","6602200","6602300","6602400","6602500","6602600","6602700","6602800","6602900"},
                {"1000701","1000702","1000703","1000704","1000705","1000706","1000707","1000708","1000709","1000710","1000711","1000712","1000713","1000714","1000715","1000716","1000717","1000718","1000719","1000720","1000721","1000722","1000723","1000724","1000725","1000726"},
                {"1000801","1000802","1000803","1000804","1000805","1000806","1000807","1000808","1000809","1000810","1000811","1000812","1000813"},
                {"1000901","1000902","1000903","1000904","1000905","1000906","1000907","1000908","1000909","1000910","1000911","1000912","1000913","1000914","1000915","1000916","1000917","1000918","1000919","1000920"},
                {"1002001","1002002"},
                {"1001001","1001002","1001003","1001004","1001005","1001006","1001007","1001008","1001009","1001010","1001011","1001012","1001013","1001014","1001015","1001016","1001017","1001018"},
                {"6700100","6700200","6700300","6700400","6700500","6700600","6700700","6700800","6700900","6701000","6701100","6701200","6701300","6701400","6701500","6701600","6701700","6701800","6701900","6702000","6702100","6702200","6702300","6702400","6702500","6702600","6702700","6702800","6702900","6703000","6703100","6703200","6703300","6703400","6703500","6703600","6703700"},
                {"6400100","6400200","6400300","6400400","6400500","6400600","6400700","6400800","6400900","6401000","6401100","6401200","6401300","6401400","6401500","6401600","6401700","6401800","6401900","6402000","6402100","6402200","6402300","6402400","6402500","6402600","6402700","6402800","6402900","6403000","6403100","6403200","6403300","6403400","6403500","6403600","6403700","6403800"},
                {"1001301","1001302","1001303","1001304","1001305","1001306","1001307","1001308","1001309","1001310","1001311","1001312","1001313","1001314","1001315","1001316","1001317","1001318","1001319","1001320","1001321","1001322","1001323","1001324","1001325","1001326","1001327","1001328","1001329","1001330","1001331","1001332","1001333"},
                {"1001401","1001402","1001403","1001404","1001405","1001406","1001407","1001408","1001409","1001410","1001411","1001412","1001413","1001414","1001415","1001416"},
                {"1001501","1001502","1001503","1001504","1001505","1001506","1001507","1001508","1001509","1001510","1001511","1001512","1001513"},
                {"1000201","1000202","1000203","1000204","1000205","1000206","1000207","1000208","1000209","1000210","1000211","1000212"},
                {"1001601","1001602","1001603","1001604","1001605","1001606"},
                {"0902001","0902002","0902003","0902004","0902005","0902006"},
                {"0900701","0900702","0900703","0900704"}
        };

        final String url = "http://www.cwb.gov.tw/V7/forecast/town368/3Hr/"+aUrl[num[0]][num[1]]+".htm";

        Thread downloadThread = new Thread() {
            public void run() {
                Document doc;

                try {
                    doc = Jsoup.connect(url).get();
                    String i = doc.select("img").attr("src").replaceAll("/V7/symbol/weather/gif/([a-z]+)/([0-9]+).gif", "$1");
                    String j = doc.select("img").attr("src").replaceAll("/V7/symbol/weather/gif/([a-z]+)/([0-9]+).gif", "$2");
                    int k = Integer.parseInt(j);

                    Intent intent = new Intent();
                    intent.putExtra("Time", i);
                    intent.putExtra("Num", k);
                    intent.setClass(MainActivity.this, Video.class);
                    startActivity(intent);

                } catch (Exception e) {
                    e.printStackTrace();
                }
            }
        };
        downloadThread.start();

    }

    //======================下拉式選單City======================//
    protected void spiCity() {
        Spinner sCity = (Spinner)findViewById(R.id.city);

        final ArrayAdapter<CharSequence> nAdapter = ArrayAdapter.createFromResource(
                this, R.array.array_city, android.R.layout.simple_spinner_item);
        sCity.setAdapter(nAdapter);
        nAdapter.setDropDownViewResource(
                android.R.layout.simple_spinner_dropdown_item);

        final String[][] aCity = {{"中正區","七堵區","暖暖區","仁愛區","中山區","安樂區","信義區"},
                {"松山區","信義區","大安區","中山區","中正區","大同區","萬華區","文山區","南港區","內湖區","士林區","北投區"},
                {"板橋區","三重區","中和區","永和區","新莊區","新店區","樹林區","鶯歌區","三峽區","淡水區","汐止區","瑞芳區","土城區","蘆洲區","五股區","泰山區","林口區","深坑區","石碇區","坪林區","三芝區","石門區","八里區","平溪區","雙溪區","貢寮區","金山區","萬里區","烏來區"},
                {"桃園區","中壢區","大溪區","楊梅區","蘆竹區","大園區","龜山區","八德區","龍潭區","平鎮區","新屋區","觀音區","復興區"},
                {"東區","北區","香山區"},
                {"竹北市","竹東鎮","新埔鎮","關西鎮","湖口鄉","新豐鄉","芎林鄉","橫山鄉","北埔鄉","寶山鄉","峨眉鄉","尖石鄉","五峰鄉"},
                {"苗栗市","苑裡鎮","通霄鎮","竹南鎮","頭份市","後龍鎮","卓蘭鎮","大湖鄉","公館鄉","銅鑼鄉","南庄鄉","頭屋鄉","三義鄉","西湖鄉","造橋鄉","三灣鄉","獅潭鄉","泰安鄉"},
                {"中區","東區","南區","北區","西屯區","南屯區","北屯區","豐原區","東勢區","大甲區","清水區","沙鹿區","梧棲區","后里區","神岡區","潭子區","大雅區","新社區","石岡區","外埔區","大安區","烏日區","大肚區","龍井區","霧峰區","太平區","大里區","和平區"},
                {"彰化市","鹿港鎮","和美鎮","線西鄉","伸港鄉","福興鄉","秀水鄉","花壇鄉","芬園鄉","員林市","溪湖鎮","田中鎮","大村鄉","埔鹽鄉","埔心鄉","永靖鄉","社頭鄉","二水鄉","北斗鎮","二林鎮","田尾鄉","埤頭鄉","芳苑鄉","大城鄉","竹塘鄉","溪州鄉"},
                {"南投市","埔里鎮","草屯鎮","竹山鎮","集集鎮","名間鄉","鹿谷鄉","中寮鄉","魚池鄉","國姓鄉","水里鄉","信義鄉","仁愛鄉"},
                {"斗六市","斗六鎮","虎尾鎮","西螺鎮","土庫鎮","北港鎮","古坑鄉","大埤鄉","莿桐鄉","林內鄉","二崙鄉","崙背鄉","麥寮鄉","東勢鄉","褒忠鄉","臺西鄉","元長鄉","四湖鄉","口湖鄉","水林鄉"},
                {"東區","西區"},
                {"太保市","朴子市","布袋鎮","大林鎮","民雄鄉","溪口鄉","新港鄉","六腳鄉","東石鄉","義竹鄉","鹿草鄉","水上鄉","中埔鄉","竹崎鄉","梅山鄉","番路鄉","大埔鄉","阿里山鄉"},
                {"新營區","鹽水區","白河區","柳營區","後壁區","東山區","麻豆區","下營區","六甲區","官田區","大內區","佳里區","學甲區","西港區","七股區","將軍區","北門區","新化區","善化區","新市區","安定區","山上區","玉井區","楠西區","南化區","左鎮區","仁德區","歸仁區","關廟區","龍崎嶇","永康區","東區","南區","北區","安南區","安平區","中西區"},
                {"鹽埕區","鼓山區","左營區","楠梓區","三民區","新興區","前金區","苓雅區","前鎮區","旗津區","小港區","鳳山區","林園區","大寮區","大樹區","大社區","仁武區","鳥松區","岡山區","橋頭區","燕巢區","田寮區","阿蓮區","路竹區","湖內區","茄萣區","永安區","彌陀區","梓官區","旗山區","美濃區","六龜區","甲仙區","杉林區","內門區","茂林區","桃源區","那瑪夏區"},
                {"屏東市","潮州鎮","東港鎮","恆春鎮","萬丹鄉","長治鄉","麟洛鄉","九如鄉","里港鄉","鹽埔鄉","高樹鄉","萬巒鄉","內埔鄉","竹田鄉","新埤鄉","枋寮鄉","新園鄉","崁頂鄉","林邊鄉","南州鄉","佳冬鄉","琉球鄉","車城鄉","滿洲鄉","枋山鄉","三地門鄉","霧臺鄉","瑪家鄉","泰武鄉","來義鄉","春日鄉","獅子鄉","牡丹鄉"},
                {"臺東市","成功鎮","關山鎮","卑南鄉","鹿野鄉","池上鄉","東河鄉","長濱鄉","太麻里鄉","大武鄉","綠島鄉","海瑞鄉","延平鄉","金峰鄉","達仁鄉","蘭嶼鄉"},
                {"花蓮縣","鳳林鎮","玉里鎮","新城鄉","吉安鄉","壽豐鄉","光復鄉","豐濱鄉","瑞穗鄉","富里鄉","秀林鄉","萬榮鄉","卓鄉鄉"},
                {"宜蘭市","羅東鎮","蘇澳鎮","頭城鎮","礁溪鄉","壯圍鄉","員山鄉","冬山鄉","五結鄉","三星鄉","大同鄉","南澳鄉"},
                {"馬公市","湖西鄉","白沙鄉","西嶼鄉","望安鄉","七美鄉"},
                {"金城鎮","金沙鎮","金湖鎮","金寧鄉","烈嶼鄉","烏坵鄉"},
                {"南竿鄉","北竿鄉","莒光鄉","東引鄉"}
        };

        sCity.setOnItemSelectedListener(new AdapterView.OnItemSelectedListener(){
            @Override
            public void onItemSelected(AdapterView<?> arg0, View arg1, int position, long arg3) {
                num[0] = position;
                spiTown(aCity[position]);
            }
            @Override
            public void onNothingSelected(AdapterView<?> arg0) {

            }
        });
    }

    //======================下拉式選單Town======================//
    protected void spiTown(String[] a) {
        Spinner sTown = (Spinner)findViewById(R.id.town);

        final ArrayAdapter<String> nA = new ArrayAdapter<>(
                this, android.R.layout.simple_spinner_dropdown_item, a);
        sTown.setAdapter(nA);
        nA.setDropDownViewResource(
                android.R.layout.simple_spinner_dropdown_item);

        sTown.setOnItemSelectedListener(new AdapterView.OnItemSelectedListener(){
            @Override
            public void onItemSelected(AdapterView<?> arg0, View arg1, int position, long arg3) {
                num[1] = position;
            }
            @Override
            public void onNothingSelected(AdapterView<?> arg0) {

            }
        });
    }
}
